# Переменная для IP-адреса
variable "ip_address" {
  description = "IP-адрес"
  type        = string
  default     = "192.168.0.1"

  validation {
    condition     = can(regex("^(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$", var.ip_address))
    error_message = "Неверный формат IP-адреса. Ожидался IPv4 адрес (например: 192.168.0.1)."
  }
}

# Переменная для списка IP-адресов
variable "ip_list" {
  description = "Список IP-адресов"
  type        = list(string)
  default = ["192.168.0.1", "1.1.1.1"]

  validation {
    condition = alltrue([
      for ip in var.ip_list :
      can(regex("^(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$", ip))
    ])
    error_message = "Один или несколько IP-адресов имеют неверный формат."
  }
}